иб/src/DataProcessors/ЗагрузкаКурсовВалют/ЗагрузкаКурсовВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаКурсовВалют</name>
  <attributes>
    <name>НачалоПериодаЗагрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеПериодаЗагрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокВалют</name>
    <attributes>
      <name>КодВалюты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаКурса</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Курс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

иб/src/Catalogs/Валюты/Валюты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Валюты</name>
  <predefined>
    <items>
      <name>Евро</name>
      <description>EUR</description>
    </items>
    <items>
      <name>Доллар</name>
      <description>USD</description>
    </items>
    <items>
      <name>Рубль</name>
      <description>руб.</description>
    </items>
  </predefined>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

иб/src/DataProcessors/ЗагрузкаКурсовВалют/Forms/Форма/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Блок обработчиков событий формы и элементов формы
//

// Обработчик события "при создании на сервере" 
// Устанавливает даты начала и конца для загрузки курсов по умолчанию
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.НачалоПериодаЗагрузки = НачалоМесяца(ТекущаяДата());
	Объект.ОкончаниеПериодаЗагрузки = ТекущаяДата();

		Стр=Объект.СписокВалют.Добавить();//ноу
		Стр.Валюта=Справочники.Валюты.Доллар;
		Стр.КодВалюты=Справочники.Валюты.Доллар.Код;
		Стр=Объект.СписокВалют.Добавить();
		Стр.Валюта=Справочники.Валюты.Евро;
		Стр.КодВалюты=Справочники.Валюты.Евро.Код;
	
КонецПроцедуры

// Обработчик события "обработка выбора" формы
// Обрабатывает выбор валюты в форме выбора
//
&НаКлиенте
Процедура ОбработкаВыбора(РезультатВыбора, ИсточникВыбора)
	
	Если ТипЗнч(РезультатВыбора) = Тип("СправочникСсылка.Валюты") Тогда
		
		Если Объект.СписокВалют.НайтиСтроки(Новый Структура("Валюта", РезультатВыбора)).Количество() = 0 Тогда
			ДобавитьВалютуВСписок(РезультатВыбора);
		Иначе
			Предупреждение(НСтр("ru = 'Валюта уже присутствует в списке'"));
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события "перед началом добавления" элемента формы СписокВалют
// Вызывает форму выбора валют в режиме выбора
//
&НаКлиенте
Процедура СписокВалютПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	ПараметрыФорма = Новый Структура("ЗагружаемыеВалюты", Истина);
	ОткрытьФорму("Справочник.Валюты.ФормаВыбора", ПараметрыФорма, ЭтаФорма);
	Отказ = Истина;
	
КонецПроцедуры

// Обработчик события "выбор" табличной части "СписокВалют" формы
// Открывает форму валюты
//
&НаКлиенте
Процедура СписокВалютВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьЗначение(Элементы.СписокВалют.ТекущиеДанные.Валюта);
	
КонецПроцедуры

// Обработчик нажаитя на кнопку "Загрузить"
// Вызывает функциональность загрузки курсов
//
&НаКлиенте
Процедура КомандаЗагрузитьВыполнить()
	
	Если Не ЗначениеЗаполнено(Объект.НачалоПериодаЗагрузки) Тогда
		ОбщегоНазначения.СообщитьПользователю(
					НСтр("ru = 'Не задана дата начала периода загрузки.'"), ,
					"Объект.НачалоПериодаЗагрузки");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ОкончаниеПериодаЗагрузки) Тогда
		ОбщегоНазначения.СообщитьПользователю(
					НСтр("ru = 'Не задана дата окончания периода загрузки.'"), ,
					"Объект.ОкончаниеПериодаЗагрузки");
		Возврат;
	КонецЕсли;
	
	Если Объект.СписокВалют.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(
					НСтр("ru = 'Для загрузки курсов с веб-сервера РБК необходимо добавить в список хотя бы одну валюту.'"), ,
					"Объект.СписокВалют");
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	Состояние(НСтр("ru = 'Загружаются курсы валют...'"));
	СтатусОперации = ЗагрузитьКурсыСРБК();
	
	Если СтатусОперации Тогда
		Оповестить("ИзменениеКурсовВалют");
		ТекстСообщенияОЗавершенииЗагрузки = НСтр("ru = 'Загрузка курсов валют завершена.'");
		Состояние(ТекстСообщенияОЗавершенииЗагрузки);
	КонецЕсли;
	ЭтаФорма.Закрыть();//ноу
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Секция служебных процедур
//

&НаКлиенте
Функция ЗагрузитьКурсыСРБК()
	
	ПоясняющееСообщение = "";
	
#Если ВебКлиент Тогда
	Результат = ЗагрузитьКурсыСРБК_Сервер(
			Объект.СписокВалют,
			Объект.НачалоПериодаЗагрузки,
			Объект.ОкончаниеПериодаЗагрузки);
#Иначе
	Результат = ФункцииКлиентСервер.ЗагрузитьКурсыВалютПоПараметрам(
				Объект.СписокВалют,
				Объект.НачалоПериодаЗагрузки,
				Объект.ОкончаниеПериодаЗагрузки);
#КонецЕсли
	
	ЕстьУспешноЗагруженныеКурсы = Ложь;
	
	Для Каждого СостояниеЗагрузки Из Результат Цикл
		Если СостояниеЗагрузки.СтатусОперации Тогда
			ЕстьУспешноЗагруженныеКурсы = Истина;
		Иначе
			Индекс = Объект.СписокВалют.Индекс(Объект.СписокВалют.НайтиСтроки(Новый Структура("Валюта", СостояниеЗагрузки.Валюта))[0]);
			ИмяПоля = СтрЗаменить("СписокВалют[x].Валюта", "x", Строка(Индекс));
			ОбщегоНазначения.СообщитьПользователю(СостояниеЗагрузки.Сообщение,, ИмяПоля, "Объект");
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьУспешноЗагруженныеКурсы Тогда
		ОбновитьСведенияВСпискеВалют();
	КонецЕсли;
	
	Возврат ЕстьУспешноЗагруженныеКурсы;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗагрузитьКурсыСРБК_Сервер(знач СписокВалют, знач НачалоПериодаЗагрузки, знач ОкончаниеПериодаЗагрузки)
	
	Возврат ФункцииКлиентСервер.ЗагрузитьКурсыВалютПоПараметрам(
				СписокВалют, НачалоПериодаЗагрузки, ОкончаниеПериодаЗагрузки);
	
КонецФункции

// Процедура добавляет в список валют новую строку и заполняет ее информацией
// о курсе на основе ссылки на валюту
//
// Параметры:
// Валюта - Справочник.Валюты / Ссылка - ссылка на валюту, которая добавляется
//                 в список
//
&НаСервере
Процедура ДобавитьВалютуВСписок(Валюта)
	
	НоваяСтрока = Объект.СписокВалют.Добавить();
	ЗаполнитьДанныеСтрокиТаблицыНаОсновеВалюты(НоваяСтрока, Валюта);
	
КонецПроцедуры

// Процедура обновляет записи о курсах валют в списке.
//
&НаСервере
Процедура ОбновитьСведенияВСпискеВалют()
	
	Для Каждого СтрокаДанных Из Объект.СписокВалют Цикл
		СсылкаНаВалюту = СтрокаДанных.Валюта;
		ЗаполнитьДанныеСтрокиТаблицыНаОсновеВалюты(СтрокаДанных, СсылкаНаВалюту);
	КонецЦикла;
	
КонецПроцедуры

// Процедура заполняет строку табличной части информацией о курсе на основе
// ссылки на валюту.
//
// Параметры:
// ТекСтрока       - ДанныеФормыЭлементКоллекции - ссылка на строку табличной
//                  части, которую необходимо заполнить информацией о курсе 
//                  валюты
// ВыбраннаяВалюта - Справочник.Валюты / Ссылка - ссылка на валюту, информацию
//                  о которой необходимо получить.
//
&НаСервере
Процедура ЗаполнитьДанныеСтрокиТаблицыНаОсновеВалюты(ТекСтрока, СсылкаНаВалюту);
	
	ТекСтрока.Валюта = СсылкаНаВалюту;
	ТекСтрока.КодВалюты = СсылкаНаВалюту.Код;
	
	ДанныеКурса = РаботаСКурсамиВалют.ЗаполнитьДанныеКурсаДляВалюты(СсылкаНаВалюту);
	
	Если ТипЗнч(ДанныеКурса) = Тип ("Структура") Тогда
		ТекСтрока.ДатаКурса = ДанныеКурса.ДатаКурса;
		ТекСтрока.Курс      = ДанныеКурса.Курс;
	КонецЕсли;
	
КонецПроцедуры
